i seem to have simular problems,
i'm  have configured 2 node pools , 1 cluster , while testing i noticed that each apply was destroying my node_pools and rebuild them again without changes in the pool configuration.

my plan output goes like this :
```
  # google_container_node_pool.preemptible-pool must be replaced
-/+ resource "google_container_node_pool" "preemptible-pool" {
        cluster             = "luc-cluster"
      ~ id                  = "projects/test-terraform-265008/locations/europe-west1/clusters/luc-cluster/nodePools/k8s-luc-cluster-preemptible-pool" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-265008/zones/europe-west1-c/instanceGroupManagers/gke-luc-cluster-k8s-luc-cluster-preem-26c29198-grp",
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-265008/zones/europe-west1-b/instanceGroupManagers/gke-luc-cluster-k8s-luc-cluster-preem-219df3a4-grp",
        ] -> (known after apply)
        location            = "europe-west1"
      ~ max_pods_per_node   = 64 -> (known after apply)
        name                = "k8s-luc-cluster-preemptible-pool"
      + name_prefix         = (known after apply)
        node_count          = 1
      ~ node_locations      = [
          - "europe-west1-b",
          - "europe-west1-c",
        ] -> (known after apply)
        project             = "test-terraform-265008"
      + region              = (known after apply)
        version             = "1.15.8-gke.2"
      + zone                = (known after apply)

        autoscaling {
            max_node_count = 2
            min_node_count = 1
        }

        management {
            auto_repair  = true
            auto_upgrade = false
        }

      ~ node_config {
            disk_size_gb      = 100
            disk_type         = "pd-standard"
          ~ guest_accelerator = [] -> (known after apply)
            image_type        = "COS"
            labels            = {
                "thesniffers.pool" = "preemptible"
            }
          ~ local_ssd_count   = 0 -> (known after apply)
            machine_type      = "n1-standard-1"
            metadata          = {
                "disable-legacy-endpoints" = "true"
            }
          ~ oauth_scopes      = [ # forces replacement
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/monitoring.write",
                "https://www.googleapis.com/auth/pubsub",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
                "https://www.googleapis.com/auth/trace.append",
            ]
            preemptible       = true
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "iap-ssh-access",
                "iap-node-access",
            ]
          ~ taint             = [] -> (known after apply)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }
        }

        upgrade_settings {
            max_surge       = 1
            max_unavailable = 0
        }
    }

  # google_container_node_pool.primary-pool must be replaced
-/+ resource "google_container_node_pool" "primary-pool" {
        cluster             = "luc-cluster"
      ~ id                  = "projects/test-terraform-265008/locations/europe-west1/clusters/luc-cluster/nodePools/k8s-luc-cluster-primary-pool" -> (known after apply)
      ~ initial_node_count  = 1 -> (known after apply)
      ~ instance_group_urls = [
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-265008/zones/europe-west1-c/instanceGroupManagers/gke-luc-cluster-k8s-luc-cluster-prima-9e18efd0-grp",
          - "https://www.googleapis.com/compute/v1/projects/test-terraform-265008/zones/europe-west1-b/instanceGroupManagers/gke-luc-cluster-k8s-luc-cluster-prima-b0a01bca-grp",
        ] -> (known after apply)
        location            = "europe-west1"
      ~ max_pods_per_node   = 64 -> (known after apply)
        name                = "k8s-luc-cluster-primary-pool"
      + name_prefix         = (known after apply)
        node_count          = 1
      ~ node_locations      = [
          - "europe-west1-b",
          - "europe-west1-c",
        ] -> (known after apply)
        project             = "test-terraform-265008"
      + region              = (known after apply)
        version             = "1.15.8-gke.2"
      + zone                = (known after apply)

        autoscaling {
            max_node_count = 2
            min_node_count = 1
        }

        management {
            auto_repair  = true
            auto_upgrade = false
        }

      ~ node_config {
            disk_size_gb      = 100
            disk_type         = "pd-standard"
          ~ guest_accelerator = [] -> (known after apply)
            image_type        = "COS"
            labels            = {
                "thesniffers.pool" = "primary"
            }
          ~ local_ssd_count   = 0 -> (known after apply)
            machine_type      = "n1-standard-4"
            metadata          = {
                "disable-legacy-endpoints" = "true"
            }
          ~ oauth_scopes      = [ # forces replacement
                "https://www.googleapis.com/auth/devstorage.read_only",
                "https://www.googleapis.com/auth/logging.write",
              - "https://www.googleapis.com/auth/monitoring",
                "https://www.googleapis.com/auth/monitoring.write",
                "https://www.googleapis.com/auth/pubsub",
                "https://www.googleapis.com/auth/service.management.readonly",
                "https://www.googleapis.com/auth/servicecontrol",
                "https://www.googleapis.com/auth/trace.append",
            ]
            preemptible       = false
          ~ service_account   = "default" -> (known after apply)
            tags              = [
                "iap-ssh-access",
                "iap-node-access",
            ]
          ~ taint             = [] -> (known after apply)

          ~ shielded_instance_config {
              ~ enable_integrity_monitoring = true -> (known after apply)
              ~ enable_secure_boot          = false -> (known after apply)
            }
        }

        upgrade_settings {
            max_surge       = 1
            max_unavailable = 0
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

for some reason the configured oauth_scopes triggers a  destroy/add sequence.
using :
luc@lap2-luc:~/src/gcloud/project-test> terraform -version
Terraform v0.12.19
+ provider.google v3.4.0
+ provider.google-beta v3.4.0

